app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 9]]
---
        <i class="far fa-comment" style="color:#BE81F7;">  </i>
        <%= @post.comments.count %>