app/controllers/homes_controller.rb

  def show
  	 @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC