app/controllers/posts_controller.rb

def create

  @post = current_user.posts.build(post_params)
  @post.categories = category_params

  # @post.categories = post_params[:categories]
    if @post.save
---
INSERT INTO "posts" ("title", "text", "created_at", "updated_at", "user_id", "imagen") VALUES (?, ?, ?, ?, ?, ?)

def index
  if params[:tag]
    @posts = Post.tagged_with(params[:tag])
  else
    @posts = Post.all
---
SELECT "posts".* FROM "posts" INNER JOIN "taggings" ON "posts"."id" = "taggings"."post_id" WHERE "taggings"."tag_id" = ? ORDER BY created_at DESC  [["tag_id", 1]]

def update
  @post = Post.find(params[:id])

  if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "imagen" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["imagen", "Screenshot_from_2018-04-24_22-43-46.png"], ["updated_at", "2018-05-10 04:56:44.607942"], ["id", 7]]

 def destroy
  @post = Post.find(params[:id])
  @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]