app/controllers/users_controller.rb

 def update
    if @user.update(user_params)
---
UPDATE "users" SET "description" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["description", "kristian serrano\r\nman 27 años\r\nfitness\r\nstyle mens"], ["updated_at", "2018-05-09 19:26:21.431674"], ["id", 1]]