app/models/post.rb

SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? ORDER BY "tags"."id" ASC LIMIT ?  [["name", "ciencia"], ["LIMIT", 1]]
---
	 def self.tagged_with(name)
	 	Tag.find_by!(name: name).posts

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = ?  [["post_id", 3]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "tecnologia"], ["created_at", "2018-05-16 03:27:33.050185"], ["updated_at", "2018-05-16 03:27:33.050185"]]
---
	 def all_tags=(names)
	 	self.tags = names.split(",").map do |name|
	 		Tag.where(name: name).first_or_create!